---
kind: type
id: T:Autodesk.Revit.DB.ModelNurbSpline
source: html/528c3e09-539e-c0e4-f6c4-900370f55d06.htm
---
# Autodesk.Revit.DB.ModelNurbSpline

Represents a ModelNurbSpline within Autodesk Revit.

## Syntax (C#)
```csharp
public class ModelNurbSpline : ModelCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
ModelCurve::geometryCurve property.